/*************************************************************************
	> File Name: 25.c
	> Author: zhushuo
	> Mail: 
	> Created Time: 2018年07月27日 星期五 10时08分23秒
 ************************************************************************/

#include <stdio.h>
//循环数组  大整数加法
int fib[3][1005] = {{0, 0}, {1, 1}, {1, 1}};
int n = 2;

int main() {
    while (fib[n % 3][0] < 1000){
        n += 1;
        int *a = fib[n % 3], *b = fib[(n - 1) % 3], *c = fib[(n - 2) % 3];
        a[0] = b[0];
        for (int i = 1; i <= b[0]; i++){
            a[i] = b[i] + c[i];
        }
        for (int i = 1; i <= a[0]; i++){
            if (a[i] < 10) continue;
            a[i + 1] += a[i] / 10;
            a[i] %= 10;
            a[0] += (i == a[0]);
        }


    }

    printf("%d\n", n);

    return 0;
}
